Segments defining the Rebar Shape must be in a continuous loop.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CurvesUnlooped { get; }
  Visual Basic
Public Shared ReadOnly Property CurvesUnlooped As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CurvesUnlooped {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarShapeFailures Class
  Autodesk.Revit.DB Namespace